<?php

namespace App\Constants;

class SMIConstants
{
    public const AREAS = [
        "คลินิกรักษ์ใจ",
        "หอผู้ป่วยสุพรรณิการ์",
        "รพ.สต.กระสัง",
        "รพ.สต.แก่นเจริญ",
        "รพ.สต.โกรกขี้หนู",
        "รพ.สต.โคกกลาง",
        "รพ.สต.โคกตาล",
        "รพ.สต.โคกหัวช้าง",
        "รพ.สต.เฉลิมพระเกียรติ ร่มโพธิ์",
        "รพ.สต.ตลาดชัย",
        "รพ.สต.บ้านบัว",
        "รพ.สต.บ้านยาง",
        "รพ.สต.บุลาว",
        "รพ.สต.ปริงเปน",
        "รพ.สต.ปีกฝาย",
        "รพ.สต.พะไล",
        "รพ.สต.ลุมปุ๊ก",
        "รพ.สต.สะแกซำ",
        "รพ.สต.สวายจีก",
        "รพ.สต.สวายสอ",
        "รพ.สต.หัววัว",
        "รพ.สต.หนองเกียบ",
        "รพ.สต.หนองตาด",
        "รพ.สต.หนองโพรง",
        "ศูนย์แพทย์ชุมชนสาขา 1 ริมละลม",
        "ศูนย์แพทย์ชุมชนสาขา 2 เทศบาลเมืองบุรีรัมย์ (บุลำดวน)",
        "ศูนย์แพทย์ชุมชนสาขา 3 อบจ.เก่า",
        "รพ.กระสัง",
        "รพ.คูเมือง",
        "รพ.แคนดง",
        "รพ.เฉลิมพระเกียรติ",
        "รพ.ชำนิ",
        "รพ.นางรอง",
        "รพ.นาโพธิ์",
        "รพ.โนนดินแดง",
        "รพ.โนนสุวรรณ",
        "รพ.บ้านกรวด",
        "รพ.บ้านด่าน",
        "รพ.บ้านใหม่ไชยพจน์",
        "รพ.ประโคนชัย",
        "รพ.ปะคำ",
        "รพ.พลับพลาชัย",
        "รพ.พุทไธสง",
        "รพ.ละหานทราย",
        "รพ.ลำปลายมาศ",
        "รพ.สตึก",
        "รพ.หนองกี่",
        "รพ.หนองหงส์",
        "รพ.ห้วยราช"
    ];

    public const AMPHOES = [
        "เมืองบุรีรัมย์",
        "กระสัง",
        "คูเมือง",
        "แคนดง",
        "เฉลิมพระเกียรติ",
        "ชำนิ",
        "นางรอง",
        "นาโพธิ์",
        "โนนดินแดง",
        "โนนสุวรรณ",
        "บ้านกรวด",
        "บ้านด่าน",
        "บ้านใหม่ไชยพจน์",
        "ประโคนชัย",
        "ปะคำ",
        "พลับพลาชัย",
        "พุทไธสง",
        "ละหานทราย",
        "ลำปลายมาศ",
        "สตึก",
        "หนองกี่",
        "หนองหงส์",
        "ห้วยราช"
    ];

    public const AMPHUR_TAMBON = [
        "เมืองบุรีรัมย์" => ["ในเมือง", "กระสัง", "กลันทา", "ชุมเห็ด", "ถลุงเหล็ก", "บัวทอง", "บ้านบัว", "บ้านยาง", "พระครู", "เมืองฝาง", "ลุมปุ๊ก", "สวายจีก", "สองห้อง", "สะแกซำ", "สะแกโพรง", "เสม็ด", "หนองตาด", "หลักเขต", "อิสาณ"],
        "กระสัง" => ["กระสัง", "กันทรารมย์", "ชุมแสง", "บ้านปรือ", "เมืองไผ่", "ลำดวน", "ศรีภูมิ", "สองชั้น", "สูงเนิน", "หนองเต็ง", "ห้วยสำราญ"],
        "คูเมือง" => ["คูเมือง", "ตูมใหญ่", "บ้านแพ", "ปะเคียบ", "พรสำราญ", "หนองขมาร", "หินเหล็กไฟ"],
        "ชำนิ" => ["ชำนิ", "โคกสนวน", "ช่อผกา", "เมืองยาง", "ละลวด", "หนองปล่อง"],
        "นางรอง" => ["นางรอง", "ก้านเหลือง", "ชุมแสง", "ถนนหัก", "ทรัพย์พระยา", "ทุ่งแสงทอง", "บ้านสิงห์", "ลำไทรโยง", "สะเดา", "หนองกง", "หนองไทร", "หนองโบสถ์", "หนองยายพิมพ์", "หนองโสน", "หัวถนน"],
        "นาโพธิ์" => ["นาโพธิ์", "ดอนกอก", "บ้านคู", "บ้านดู่", "ศรีสว่าง"],
        "บ้านกรวด" => ["บ้านกรวด", "เขาดินเหนือ", "จันทบเพชร", "โนนเจริญ", "บึงเจริญ", "ปราสาท", "สายตะกู", "หนองไม้งาม", "หินลาด"],
        "บ้านด่าน" => ["บ้านด่าน", "โนนขวาง", "ปราสาท", "วังเหนือ"],
        "บ้านใหม่ไชยพจน์" => ["กู่สวนแตง", "แดงใหญ่", "ทองหลาง", "หนองเยือง", "หนองแวง"],
        "ประโคนชัย" => ["ประโคนชัย", "เขาคอก", "โคกตูม", "โคกมะขาม", "โคกม้า", "โคกย่าง", "จรเข้มาก", "ตะโกตาพิ", "บ้านไทร", "ประทัดบุ", "ปังกู", "ไพศาล", "ละเวี้ย", "สี่เหลี่ยม", "แสลงโทน", "หนองบอน"],
        "ปะคำ" => ["ปะคำ", "โคกมะม่วง", "ไทยเจริญ", "หนองบัว", "หูทำนบ"],
        "พลับพลาชัย" => ["โคกขมิ้น", "จันดุม", "ป่าชัน", "สะเดา", "สำโรง"],
        "พุทไธสง" => ["พุทไธสง", "บ้านจาน", "บ้านเป้า", "บ้านยาง", "บ้านแวง", "มะเฟือง", "หายโศก"],
        "ละหานทราย" => ["ละหานทราย", "โคกว่าน", "ตาจง", "สำโรงใหม่", "หนองตะครอง", "หนองแวง"],
        "ลำปลายมาศ" => ["ลำปลายมาศ", "โคกกลาง", "โคกล่าม", "โคกสะอาด", "ตลาดโพธิ์", "ทะเมนชัย", "บ้านยาง", "บุโพธิ์", "ผไทรินทร์", "เมืองแฝก", "แสลงพัน", "หนองกะทิง", "หนองคู", "หนองโดน", "หนองบัวโคก", "หินโคน"],
        "สตึก" => ["สตึก", "กระสัง", "ชุมแสง", "ดอนมนต์", "ท่าม่วง", "ทุ่งวัง", "นิคม", "เมืองแก", "ร่อนทอง", "สนามชัย", "สะแก", "หนองใหญ่"],
        "หนองกี่" => ["หนองกี่", "โคกสว่าง", "โคกสูง", "ดอนอะราง", "ท่าโพธิ์ชัย", "ทุ่งกระตาดพัฒนา", "ทุ่งกระเต็น", "บุกระสัง", "เมืองไผ่", "เย้ยปราสาท"],
        "หนองหงส์" => ["หนองหงส์", "ไทยสามัคคี", "เมืองฝ้าย", "สระแก้ว", "สระทอง", "เสาเดียว", "หนองชัยศรี", "ห้วยหิน"],
        "ห้วยราช" => ["ห้วยราช", "โคกเหล็ก", "ตาเสา", "บ้านตะโก", "เมืองโพธิ์", "สนวน", "สามแวง", "ห้วยราชา"],
        "เฉลิมพระเกียรติ" => ["เจริญสุข", "ตาเป๊ก", "ถาวร", "ยายแย้มวัฒนา", "อีสานเขต"],
        "แคนดง" => ["แคนดง", "ดงพลอง", "สระบัว", "หัวฝาย"],
        "โนนสุวรรณ" => ["โนนสุวรรณ", "โกรกแก้ว", "ดงอีจาน", "ทุ่งจังหัน"],
        "โนนดินแดง" => ["โนนดินแดง", "ลำนางรอง", "ส้มป่อย"]
    ];

    public const ICD10 = [
        "F00-F09 Organic, including symptomatic, mental disorders",
        "F10-F19 Mental and behavioural disorders due to psychoactive substance use",
        "F20-F29 Schizophrenia, schizotypal and delusional disorders",
        "F30-F39 Mood [affective] disorders",
        "F40-F48 Neurotic, stress-related and somatoform disorders",
        "F50-F59 Behavioural syndromes associated with physiological disturbances and physical factors",
        "F60-F69 Disorders of adult personality and behaviour",
        "F70-F79 Mental retardation",
        "F80-F89 Disorders of psychological development",
        "F90-F98 Behavioural and emotional disorders with onset usually occurring in childhood and adolescence",
        "F99-F99 Unspecified mental disorder"
    ];

    public const SMIV_TYPES = [
        "SMI-V 1" => "SMI-V 1 : มีประวัติการฆ่าตัวตาย โดยตั้งใจจะให้เสียชีวิต",
        "SMI-V 2" => "SMI-V 2 : มีประวัติการก่อความรุนแรง ทำร้ายผู้อื่นหรือสร้างความรุนแรงในชุมชน",
        "SMI-V 3" => "SMI-V 3 : อาการทางจิตปัจจุบันของผู้ป่วย มีอาการหลงผิด เสี่ยงต่อการก่อความรุนแรงต่อผู้อื่น",
        "SMI-V 4" => "SMI-V 4 : มีประวัติก่อคดีอาญารุนแรง",
        "รักษ์ใจติดตาม" => "รักษ์ใจติดตาม (ไม่เข้าเกณฑ์ SMI-V)"
    ];

    public const OAS_OPTIONS = [
        '3' => [
            'ทำร้ายตนเองรุนแรง เช่น มีรอยช้ำ มีรอยกรีดลึก เลือดออก หรือมีการบาดเจ็บอวัยวะภายใน หรือหมดสติ ฯลฯ',
            'พูดข่มขู่จะทำร้ายผู้อื่นชัดเจน เช่น ฉันจะฆ่าแก ฯลฯ',
            'ทำร้ายผู้อื่นจนได้รับบาดเจ็บ เช่น ช้ำ เคล็ด บวม เกิดบาดแผล กระดูกหัก หรือเกิดการบาดเจ็บของอวัยวะภายใน หรือหมดสติ ฯลฯ',
            'ทำสิ่งของแตกหัก กระจัดกระจาย เช่น ทุบกระจก ขว้างแก้ว จาน มีด หรือสิ่งของที่เป็นอันตราย หรือจุดไฟเผา ฯลฯ'
        ],
        '2' => [
            'ขีดข่วนผิวหนัง ตีตนเอง ดึงผม โขกศีรษะตัวเองเป็นรอยขนาดเล็ก',
            'ด่าคำหยาบคาย ใช้คำสกปรกรุนแรง',
            'แสดงท่าทางคุกคาม เช่น ถลกเสื้อผ้า ทำท่าต่อยลม หรือกระชากคอเสื้อผู้อื่น พุ่งชน เตะ ผลัก หรือดึงผมผู้อื่น แต่ไม่ได้รับบาดเจ็บ',
            'ขว้าง เตะ ทุบวัตถุ หรือสิ่งของ'
        ],
        '1' => [
            'หงุดหงิดส่งเสียงดังตะโกนด้วยความโกรธ หรือตะโกนด่าผู้อื่นด้วยถ้อยคำไม่รุนแรง',
            'ปิดประตูเสียงดัง',
            'รื้อข้าวของกระจาย'
        ],
        '0' => [
            'ไม่มีอาการข้างต้น'
        ]
    ];

    public const SUBSTANCES = [
        'บุหรี่/ บุหรี่ไฟฟ้า',
        'เครื่องดื่มแอลกอฮอล์',
        'ยาบ้า',
        'กัญชา',
        'กระท่อม',
        'ยาไอซ์/ ยาเค',
        'อื่นๆ'
    ];
}
